src/net/cbtltd/rest/openbook/xml/HotelReservation02.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsse:Security soap:mustUnderstand="1"
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>ALBANY</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Gfdfjkiropnl7638</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<OTA_HotelRateAmountNotifRQ EchoToken="1861375"
			TimeStamp="2012-11-08T19:17:30-05:00" Version="1.00"
			xmlns="http://www.opentravel.org/OTA/2003/05" xmlns:xsi="http://www.w3.org/2001/XMLSchemainstance">
			<RateAmountMessages HotelCode="SKYW869">
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-02" End="2012-12-02"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-02" End="2012-12-02"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-03" End="2012-12-03"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-03" End="2012-12-03"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-04" End="2012-12-04"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-04" End="2012-12-04"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-05" End="2012-12-05"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-05" End="2012-12-05"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-06" End="2012-12-06"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-06" End="2012-12-06"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-07" End="2012-12-07"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="229.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-07" End="2012-12-07"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="229.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-08" End="2012-12-08"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="119.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-08" End="2012-12-08"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="119.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-09" End="2012-12-09"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-09" End="2012-12-09"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-10" End="2012-12-10"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-10" End="2012-12-10"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-11" End="2012-12-11"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-11" End="2012-12-11"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-12" End="2012-12-12"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-12" End="2012-12-12"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-13" End="2012-12-13"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-13" End="2012-12-13"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-14" End="2012-12-14"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="89.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-14" End="2012-12-14"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="89.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-15" End="2012-12-15"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="89.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-15" End="2012-12-15"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="89.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-16" End="2012-12-16"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-16" End="2012-12-16"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-17" End="2012-12-17"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-17" End="2012-12-17"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-18" End="2012-12-18"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-18" End="2012-12-18"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-19" End="2012-12-19"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-19" End="2012-12-19"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="DBL"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-20" End="2012-12-20"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
				<RateAmountMessage>
					<StatusApplicationControl InvTypeCode="TWN"
						RatePlanCode="ADV" />
					<Rates>
						<Rate CurrencyCode="GB" Start="2012-12-20" End="2012-12-20"
							Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
							<BaseByGuestAmts>
								<BaseByGuestAmt AmountAfterTax="60.00" />
							</BaseByGuestAmts>
						</Rate>
					</Rates>
				</RateAmountMessage>
			</RateAmountMessages>
		</OTA_HotelRateAmountNotifRQ>
	</soap:Body>
</soap:Envelope>
